[{"id":6,"name":"Billeteo","image":"billeteo.png","link":"http://www.billeteo.com","added":"04-02-2011","comment":"My taste of the \"startup\" world. Along [Marc Abegon][1] we decided to start an online project related to theatres. The project has been a bumpy road, with several technical issues along the way (bad decisions and other problems), but we also learned A LOT and grew as developers and in many other areas (communication, design, etc).\r\n\r\nCurrently we are pivoting the idea, giving a last push to see if it can succeed. So what you may see in the url is probably outdated and just a testimony of past work :)\r\n\r\n\r\n  [1]: http://fr.linkedin.com/pub/marc-abegon/6/16b/112","status":"In development (url has outdated content)"},{"id":5,"name":"Play Modules","image":"playmodules.png","link":"https://github.com/pvillega/Play-Modules","added":"13-05-2012","comment":"This application allows the management of [Play Framework][1] modules and demos. When I created it there was no page to manage them properly. Since 2.0 was released I was looking for some project to learn Play 2.0 and improve my grasp on Scala, so I though on creating this. \r\n\r\nNow I'll be helping merge the source into the [official Play Framework repository][2], so at some point the project will be replaced by the official version.\r\n\r\n\r\n  [1]: http://www.playframework.org/\r\n  [2]: https://github.com/playframework/modules.playframework.org","status":"Live ([link][1]) - maintenance mode\r\n\r\n\r\n  [1]: http://www.playmodules.net/"},{"id":2,"name":"GSOC 2010: Dspace","image":"gsoc2010.jpg","link":"https://github.com/pvillega/GSOC--Dspace-testing","added":"01-10-2010","comment":"As part of Google Summer of Code 2010, I collaborated with Duraspace (the organization behind [Dspace][1]) to add Unit Testing to Dspace, with the aim to increase code quality in the application. It was the first GSOC project for Dspace that went into trunk (being the second year in a row that they were part of the program), and soon after the merge my code helped detect and correct some issues with the release under development at that time.\r\n\r\n\r\n  [1]: http://www.dspace.org/","status":"Completed "},{"id":3,"name":"MyNet","image":"mynet.png","link":"https://github.com/pvillega/MyNet","added":"05-06-2010","comment":"As part of my [Master in Open Source][1], I had to develop a web application using open source technologies. I decided to build something using [Seam][2] (version 2 at that time), as I was interested in the framework. It was good practice, although I'm afraid I didn't get to like Seam as much as I expected.\r\n\r\nThe code can be found [here][3]. It's released under [Affero GPL v3 license][4].\r\n\r\n\r\n  [1]: http://www.uoc.edu/studies/mof/free_software/oficiales/master_oficial_software_libre/master_oficial_software_libre_plan.htm\r\n  [2]: http://seamframework.org/\r\n  [3]: https://github.com/pvillega/MyNet\r\n  [4]: http://en.wikipedia.org/wiki/Affero_General_Public_License","status":"Completed"},{"id":4,"name":"EiA Calculator","image":"EiACover.jpg","link":"https://github.com/pvillega/Empire-in-Arms-Calculator","added":"06-03-2010","comment":"As a geek I like many kinds of games, but one I enjoy a lot is [Empire in Arms][1], a board strategy game that I play via email with some friends. One of the most important aspects is to select the right strategy for combats, so I tried to \"cheat\" a bit by generating a calculator that returned the optimum choice given a combat scenario. The game is quite complex, with many factors involved in the outcome of a combat.\r\n\r\nThis small project was a excuse to learn Lift and Scala. I warn you that it was my first Scala (version 2.7) app so the code may be quite...rough :) \r\n\r\n\r\n  [1]: http://en.wikipedia.org/wiki/Empires_in_Arms","status":"Completed"}]